package com.basic3;

public class Test3 {
    public static void main(String[] args) {
        /*
         * 强制类型转换
         * 转换的类型值必须在转换的类型的取值范围内
         * 虽然不报错，但是会丢失精度
         * */


        /*
         * 丢失精度的过程
         * 将int类型的数据赋值给byte类型的变量
         * int 128 = 0000 0000 0000 0000 0000 0000 1000 0000
         * 取后8位
         * byte -128 = 1000 0000
         * */

//        int a = 128;
//        byte b = (byte) a;
//
//        System.out.println(b); // -128


        /*
         * int a = 200 = 0000 0000 0000 0000 0000 0000 1100 1000
         * 取后8位
         * byte -56 = 1100 1000
         *
         * 二进制原码 1100 1000
         * 二进制反码 1011 0111
         * 二进制补码 1011 1000
         * 2*3 + 2*4 +2*5 +2*7
         * 8 + 16 + 32 + 128 = 184 > 127
         * 精度丢失，丢失的是最高位的1 所以是-56
         * 这里强调！精度丢失，不会丢失符号位，所以是负数
         * */

        int a = 200;
        byte b = (byte) a;

        System.out.println(b); // -56

    }
}
