package com.numerationsystem;

public class Test5 {
    public static void main(String[] args) {
        /*
         * 源码反码补码
         * 计算机的运算器只做加法，没有减法，所以计算机中的减法是通过加上一个数的相反数来实现的
         * 乘法：左移
         * 除法：右移
         *
         * 二进制的最高位是符号位，0表示正数，1表示负数
         * 正数的反码和补码都是其本身
         * 负数的反码是其本身符号位不变，其他位取反
         * 原码：0000 0000 0000 0000 0000 0000 0000 0110
         * 反码：1111 1111 1111 1111 1111 1111 1111 1001
         * 补码：1111 1111 1111 1111 1111 1111 1111 1010
         *
         * 为什么要有反码和补码
         * 1.计算机中只有加法，没有减法，所以计算机中的减法是通过加上一个数的相反数来实现的
         * 1.计算机中只有加法，没有减法，所以计算机中的减法是通过加上一个数的相反数来实现的
         * */
    }
}
